grevaillot/svd_tools/headers/ATSAMV71J20/usart1.h
#pragma once 

/* --- USART1: Universal Synchronous Asynchronous Receiver Transmitter  */

/** @defgroup usart1_registers Universal Synchronous Asynchronous Receiver Transmitter Register
@{*/

/** USART1_US_CR Control Register **/
#define USART1_US_CR			MMIO32(USART1_BASE + 0x00)
/** USART1_US_MR Mode Register **/
#define USART1_US_MR			MMIO32(USART1_BASE + 0x04)
/** USART1_US_IER Interrupt Enable Register **/
#define USART1_US_IER			MMIO32(USART1_BASE + 0x08)
/** USART1_US_IDR Interrupt Disable Register **/
#define USART1_US_IDR			MMIO32(USART1_BASE + 0x0c)
/** USART1_US_IMR Interrupt Mask Register **/
#define USART1_US_IMR			MMIO32(USART1_BASE + 0x10)
/** USART1_US_CSR Channel Status Register **/
#define USART1_US_CSR			MMIO32(USART1_BASE + 0x14)
/** USART1_US_RHR Receive Holding Register **/
#define USART1_US_RHR			MMIO32(USART1_BASE + 0x18)
/** USART1_US_THR Transmit Holding Register **/
#define USART1_US_THR			MMIO32(USART1_BASE + 0x1c)
/** USART1_US_BRGR Baud Rate Generator Register **/
#define USART1_US_BRGR			MMIO32(USART1_BASE + 0x20)
/** USART1_US_RTOR Receiver Timeout Register **/
#define USART1_US_RTOR			MMIO32(USART1_BASE + 0x24)
/** USART1_US_TTGR Transmitter Timeguard Register **/
#define USART1_US_TTGR			MMIO32(USART1_BASE + 0x28)
/** USART1_US_FIDI FI DI Ratio Register **/
#define USART1_US_FIDI			MMIO32(USART1_BASE + 0x40)
/** USART1_US_NER Number of Errors Register **/
#define USART1_US_NER			MMIO32(USART1_BASE + 0x44)
/** USART1_US_IF IrDA Filter Register **/
#define USART1_US_IF			MMIO32(USART1_BASE + 0x4c)
/** USART1_US_MAN Manchester Configuration Register **/
#define USART1_US_MAN			MMIO32(USART1_BASE + 0x50)
/** USART1_US_LINMR LIN Mode Register **/
#define USART1_US_LINMR			MMIO32(USART1_BASE + 0x54)
/** USART1_US_LINIR LIN Identifier Register **/
#define USART1_US_LINIR			MMIO32(USART1_BASE + 0x58)
/** USART1_US_LINBRR LIN Baud Rate Register **/
#define USART1_US_LINBRR			MMIO32(USART1_BASE + 0x5c)
/** USART1_US_LONMR LON Mode Register **/
#define USART1_US_LONMR			MMIO32(USART1_BASE + 0x60)
/** USART1_US_LONPR LON Preamble Register **/
#define USART1_US_LONPR			MMIO32(USART1_BASE + 0x64)
/** USART1_US_LONDL LON Data Length Register **/
#define USART1_US_LONDL			MMIO32(USART1_BASE + 0x68)
/** USART1_US_LONL2HDR LON L2HDR Register **/
#define USART1_US_LONL2HDR			MMIO32(USART1_BASE + 0x6c)
/** USART1_US_LONBL LON Backlog Register **/
#define USART1_US_LONBL			MMIO32(USART1_BASE + 0x70)
/** USART1_US_LONB1TX LON Beta1 Tx Register **/
#define USART1_US_LONB1TX			MMIO32(USART1_BASE + 0x74)
/** USART1_US_LONB1RX LON Beta1 Rx Register **/
#define USART1_US_LONB1RX			MMIO32(USART1_BASE + 0x78)
/** USART1_US_LONPRIO LON Priority Register **/
#define USART1_US_LONPRIO			MMIO32(USART1_BASE + 0x7c)
/** USART1_US_IDTTX LON IDT Tx Register **/
#define USART1_US_IDTTX			MMIO32(USART1_BASE + 0x80)
/** USART1_US_IDTRX LON IDT Rx Register **/
#define USART1_US_IDTRX			MMIO32(USART1_BASE + 0x84)
/** USART1_US_ICDIFF IC DIFF Register **/
#define USART1_US_ICDIFF			MMIO32(USART1_BASE + 0x88)
/** USART1_US_WPMR Write Protection Mode Register **/
#define USART1_US_WPMR			MMIO32(USART1_BASE + 0xe4)
/** USART1_US_WPSR Write Protection Status Register **/
#define USART1_US_WPSR			MMIO32(USART1_BASE + 0xe8)
/** USART1_US_VERSION Version Register **/
#define USART1_US_VERSION			MMIO32(USART1_BASE + 0xfc)

/**@}*/


/** @defgroup usart1_us_cr USCR Control Register
@{*/

/** USART1_US_CR_LINWKUP Send LIN Wakeup Signal **/
#define USART1_US_CR_LINWKUP		(1 << 21)
/** USART1_US_CR_LINABT Abort LIN Transmission **/
#define USART1_US_CR_LINABT		(1 << 20)
/** USART1_US_CR_RTSDIS Request to Send Pin Control **/
#define USART1_US_CR_RTSDIS		(1 << 19)
/** USART1_US_CR_RTSEN Request to Send Pin Control **/
#define USART1_US_CR_RTSEN		(1 << 18)
/** USART1_US_CR_DTRDIS Data Terminal Ready Disable **/
#define USART1_US_CR_DTRDIS		(1 << 17)
/** USART1_US_CR_DTREN Data Terminal Ready Enable **/
#define USART1_US_CR_DTREN		(1 << 16)
/** USART1_US_CR_RETTO Start Timeout Immediately **/
#define USART1_US_CR_RETTO		(1 << 15)
/** USART1_US_CR_RSTNACK Reset Non Acknowledge **/
#define USART1_US_CR_RSTNACK		(1 << 14)
/** USART1_US_CR_RSTIT Reset Iterations **/
#define USART1_US_CR_RSTIT		(1 << 13)
/** USART1_US_CR_SENDA Send Address **/
#define USART1_US_CR_SENDA		(1 << 12)
/** USART1_US_CR_STTTO Clear TIMEOUT Flag and Start Timeout After Next Character Received **/
#define USART1_US_CR_STTTO		(1 << 11)
/** USART1_US_CR_STPBRK Stop Break **/
#define USART1_US_CR_STPBRK		(1 << 10)
/** USART1_US_CR_STTBRK Start Break **/
#define USART1_US_CR_STTBRK		(1 << 9)
/** USART1_US_CR_RSTSTA Reset Status Bits **/
#define USART1_US_CR_RSTSTA		(1 << 8)
/** USART1_US_CR_TXDIS Transmitter Disable **/
#define USART1_US_CR_TXDIS		(1 << 7)
/** USART1_US_CR_TXEN Transmitter Enable **/
#define USART1_US_CR_TXEN		(1 << 6)
/** USART1_US_CR_RXDIS Receiver Disable **/
#define USART1_US_CR_RXDIS		(1 << 5)
/** USART1_US_CR_RXEN Receiver Enable **/
#define USART1_US_CR_RXEN		(1 << 4)
/** USART1_US_CR_RSTTX Reset Transmitter **/
#define USART1_US_CR_RSTTX		(1 << 3)
/** USART1_US_CR_RSTRX Reset Receiver **/
#define USART1_US_CR_RSTRX		(1 << 2)

/**@}*/

/** @defgroup usart1_us_mr USMR Mode Register
@{*/

/** USART1_US_MR_ONEBIT Start Frame Delimiter Selector **/
#define USART1_US_MR_ONEBIT		(1 << 31)
/** USART1_US_MR_MODSYNC Manchester Synchronization Mode **/
#define USART1_US_MR_MODSYNC		(1 << 30)
/** USART1_US_MR_MAN Manchester Encoder/Decoder Enable **/
#define USART1_US_MR_MAN		(1 << 29)
/** USART1_US_MR_FILTER Receive Line Filter **/
#define USART1_US_MR_FILTER		(1 << 28)

#define USART1_US_MR_MAX_ITERATION_SHIFT		24
#define USART1_US_MR_MAX_ITERATION_MASK		0x07
/** @defgroup usart1_us_mr_max_iteration MAXITERATION Maximum Number of Automatic Iteration
@{*/
/**@}*/

/** USART1_US_MR_INVDATA Inverted Data **/
#define USART1_US_MR_INVDATA		(1 << 23)
/** USART1_US_MR_VAR_SYNC Variable Synchronization of Command/Data Sync Start Frame Delimiter **/
#define USART1_US_MR_VAR_SYNC		(1 << 22)
/** USART1_US_MR_DSNACK Disable Successive NACK **/
#define USART1_US_MR_DSNACK		(1 << 21)
/** USART1_US_MR_INACK Inhibit Non Acknowledge **/
#define USART1_US_MR_INACK		(1 << 20)
/** USART1_US_MR_OVER Oversampling Mode **/
#define USART1_US_MR_OVER		(1 << 19)
/** USART1_US_MR_CLKO Clock Output Select **/
#define USART1_US_MR_CLKO		(1 << 18)
/** USART1_US_MR_MODE9 9-bit Character Length **/
#define USART1_US_MR_MODE9		(1 << 17)
/** USART1_US_MR_MSBF Bit Order **/
#define USART1_US_MR_MSBF		(1 << 16)

#define USART1_US_MR_CHMODE_SHIFT		14
#define USART1_US_MR_CHMODE_MASK		0x03
/** @defgroup usart1_us_mr_chmode CHMODE Channel Mode
@{*/
/**@}*/


#define USART1_US_MR_NBSTOP_SHIFT		12
#define USART1_US_MR_NBSTOP_MASK		0x03
/** @defgroup usart1_us_mr_nbstop NBSTOP Number of Stop Bits
@{*/
/**@}*/


#define USART1_US_MR_PAR_SHIFT		9
#define USART1_US_MR_PAR_MASK		0x07
/** @defgroup usart1_us_mr_par PAR Parity Type
@{*/
/**@}*/

